<font color="blue" size=5><b>Pandas</b></font>

In [19]:
import pandas as pd

<font color="red" size=3><b>Pandas Series</b></font>

In [136]:
# Pandas series is a one-dimentional labelled array that can hold data of differnt types (integer,string,float)
series = pd.Series([85, 72, 93, 65, 78], index=['Alice', 'Bob', 'Charlie', 'David', 'Eve'])
series

Alice      85
Bob        72
Charlie    93
David      65
Eve        78
dtype: int64

In [134]:
# Series from dict
data = {'a': 10, 'b':20, 'd':90}
series1 = pd.Series(data)
series1

a    10
b    20
d    90
dtype: int64

In [137]:
# Series from list
lst = [56, 43, 12]
series2 = pd.Series(lst)
series2

0    56
1    43
2    12
dtype: int64

In [138]:
# Series from tuple
tup = (56, 43, 12)
series3 = pd.Series(tup)
series3

0    56
1    43
2    12
dtype: int64

In [142]:
# to find the size of the series
print(series3.size)
print(len(series))

3
5

In [144]:
series.info()

<class 'pandas.core.series.Series'>
Index: 5 entries, Alice to Eve
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 252.0+ bytes

**Note** : We can't create Series from sets

<font color="red" size=3><b>Pandas Data Frames</b></font>

In [152]:
# Data Frame is a 2D labelled structure of rows and columns
# DataFrame froma a dict
data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data1)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [153]:
# the number of rows
len(df)

3

In [154]:
# number of elements in the DataFrame
df.size

9

In [157]:
# DataFrame from a list of list
data2 = [['Alice', 25, 'New York'],
        ['Bob', 30, 'San Francisco'],
        ['Charlie', 35, 'Los Angeles']]

df2 = pd.DataFrame(data2, columns=['Name', 'Age', 'City'])
df2

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

<font color="red" size=3><b>To read data from csv</b></font>

In [20]:
df1 = pd.read_csv('TCS.NSE.csv') # pandas always reads structured data
df2 = pd.read_csv('TCS.NSE.csv',header=None) # first row won't be considered as column name

<font color="red" size=3><b>To show records</b></font>

In [21]:
df1.head() # shows initial 5 records by default

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,1283.500000,1283.500000,1270.500000,1272.775024,1114.909302,366830.0
1,2015-01-02,1275.500000,1295.474976,1275.300049,1289.724976,1129.757202,925740.0
2,2015-01-05,1290.500000,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0
3,2015-01-06,1264.550049,1264.550049,1220.000000,1223.300049,1071.570801,2423784.0
4,2015-01-07,1235.000000,1239.574951,1203.724976,1208.849976,1058.912842,2636332.0

In [22]:
df2.head()

,0,1,2,3,4,5,6
0,Date,Open,High,Low,Close,Adj Close,Volume
1,2015-01-01,1283.500000,1283.500000,1270.500000,1272.775024,1114.909302,366830
2,2015-01-02,1275.500000,1295.474976,1275.300049,1289.724976,1129.757202,925740
3,2015-01-05,1290.500000,1299.949951,1262.324951,1270.125000,1112.587769,1754242
4,2015-01-06,1264.550049,1264.550049,1220.000000,1223.300049,1071.570801,2423784

In [23]:
df1.tail() # shows the last 5 rows by default

,Date,Open,High,Low,Close,Adj Close,Volume
1661,2021-09-24,3890.000000,3944.399902,3855.000000,3871.300049,3871.300049,2320754.0
1662,2021-09-27,3900.000000,3904.000000,3802.899902,3836.949951,3836.949951,1673362.0
1663,2021-09-28,3850.000000,3850.000000,3751.250000,3779.149902,3779.149902,2253075.0
1664,2021-09-29,3759.800049,3806.000000,3722.149902,3791.899902,3791.899902,2489161.0
1665,2021-09-30,3805.000000,3805.000000,3750.100098,3775.550049,3775.550049,2252412.0

In [24]:
type(df1)

pandas.core.frame.DataFrame

<font color="red" size=3><b>Column names</b></font>

In [28]:
df1.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

<font color="red" size=3><b>To select a single column</b></font>

In [32]:
# to select a particular col(single column)
c1 = df1['Open']
print(c1)
print(type(c1)) #series

0       1283.500000
1       1275.500000
2       1290.500000
3       1264.550049
4       1235.000000
           ...
1661    3890.000000
1662    3900.000000
1663    3850.000000
1664    3759.800049
1665    3805.000000
Name: Open, Length: 1666, dtype: float64
<class 'pandas.core.series.Series'>

In [34]:
c2 = df1[['Open']]
print(c2)
print(type(c2)) #dataframe

             Open
0     1283.500000
1     1275.500000
2     1290.500000
3     1264.550049
4     1235.000000
...           ...
1661  3890.000000
1662  3900.000000
1663  3850.000000
1664  3759.800049
1665  3805.000000

[1666 rows x 1 columns]
<class 'pandas.core.frame.DataFrame'>

<font color="red" size=3><b>To select multiple columns</b></font>

In [37]:
c3 = df1[['Open','Low','Close']] # notice its a list of list
c3

             Open          Low        Close
0     1283.500000  1270.500000  1272.775024
1     1275.500000  1275.300049  1289.724976
2     1290.500000  1262.324951  1270.125000
3     1264.550049  1220.000000  1223.300049
4     1235.000000  1203.724976  1208.849976
...           ...          ...          ...
1661  3890.000000  3855.000000  3871.300049
1662  3900.000000  3802.899902  3836.949951
1663  3850.000000  3751.250000  3779.149902
1664  3759.800049  3722.149902  3791.899902
1665  3805.000000  3750.100098  3775.550049

[1666 rows x 3 columns]

<font color="red" size=3><b>To select particular rows</b></font>

In [120]:
df1[1:3]

,Date,Open,High,Low,Close,Adj Close,Volume
1,2015-01-02,1275.5,1295.474976,1275.300049,1289.724976,1129.757202,925740.0
2,2015-01-05,1290.5,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0

In [126]:
df1.iloc[1:3] # iloc is used for integer-based indexing, which means it allows you to select rows and columns by their integer positions.
# the first paramter is for row and second is for column

,Date,Open,High,Low,Close,Adj Close,Volume
1,2015-01-02,1275.5,1295.474976,1275.300049,1289.724976,1129.757202,925740.0
2,2015-01-05,1290.5,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0

In [128]:
df1.loc[[1,2,3]] # loc is used for label-based indexing, which means it allows you to select rows and columns by their labels (names)
# the first paramter is for row and second is for column

,Date,Open,High,Low,Close,Adj Close,Volume
1,2015-01-02,1275.500000,1295.474976,1275.300049,1289.724976,1129.757202,925740.0
2,2015-01-05,1290.500000,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0
3,2015-01-06,1264.550049,1264.550049,1220.000000,1223.300049,1071.570801,2423784.0

In [129]:
df1.loc[2:5]

,Date,Open,High,Low,Close,Adj Close,Volume
2,2015-01-05,1290.500000,1299.949951,1262.324951,1270.125000,1112.587769,1754242.0
3,2015-01-06,1264.550049,1264.550049,1220.000000,1223.300049,1071.570801,2423784.0
4,2015-01-07,1235.000000,1239.574951,1203.724976,1208.849976,1058.912842,2636332.0
5,2015-01-08,1221.199951,1224.500000,1210.275024,1221.900024,1070.343994,1565408.0

<font color="red" size=3><b>To select particular rows of particular columns</b></font>

In [119]:
df1[['Date','High','Low']][1:5]

         Date         High          Low
1  2015-01-02  1295.474976  1275.300049
2  2015-01-05  1299.949951  1262.324951
3  2015-01-06  1264.550049  1220.000000
4  2015-01-07  1239.574951  1203.724976

In [125]:
df1.iloc[1:5,[0,2,3]] # selection row 1 to row 4 and column 0,2 3

         Date         High          Low
1  2015-01-02  1295.474976  1275.300049
2  2015-01-05  1299.949951  1262.324951
3  2015-01-06  1264.550049  1220.000000
4  2015-01-07  1239.574951  1203.724976

In [130]:
df1.loc[1:5,['Date','High','Low']]

         Date         High          Low
1  2015-01-02  1295.474976  1275.300049
2  2015-01-05  1299.949951  1262.324951
3  2015-01-06  1264.550049  1220.000000
4  2015-01-07  1239.574951  1203.724976
5  2015-01-08  1224.500000  1210.275024

<font color="red" size=3><b>To check the data types of columns</b></font>

In [38]:
df1.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume       float64
dtype: object

In [40]:
pip install lxml

Requirement already satisfied: lxml in c:\users\paulami maitra\anaconda3\lib\site-packages (4.9.3)
Note: you may need to restart the kernel to use updated packages.

<font color="red" size=3><b>To read data from html</b></font>

In [46]:
import lxml
a = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2024.html") # it returns a list of all the tables encountered 
len(a) # 13 tables present

13

In [49]:
d1 = a[1]
d1.head(8)

            Western Conference   W   L   W/L%    GB   PS/G   PA/G   SRS
0   Oklahoma City Thunder* (1)  57  25  0.695     —  120.1  112.7  7.36
1          Denver Nuggets* (2)  57  25  0.695     —  114.9  109.6  5.23
2  Minnesota Timberwolves* (3)  56  26  0.683   1.0  113.0  106.5  6.39
3    Los Angeles Clippers* (4)  51  31  0.622   6.0  115.6  112.3  3.41
4        Dallas Mavericks* (5)  50  32  0.610   7.0  117.9  115.6  2.30
5            Phoenix Suns* (6)  49  33  0.598   8.0  116.2  113.2  3.08
6    New Orleans Pelicans* (7)  49  33  0.598   8.0  115.1  110.7  4.46
7      Los Angeles Lakers* (8)  47  35  0.573  10.0  118.0  117.4  1.07

In [51]:
d1.to_csv("Basketball.csv", index=False) # will get saved locally

<font color="red" size=3><b>--------------Titanic Dataset--------------</b></font>

In [79]:
df = pd.read_csv('train_clean.csv')

In [80]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,Mr,1
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,Mrs,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,Miss,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,Mrs,1
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,Mr,0

In [81]:
lst = df.columns
lst

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title', 'Family_Size'],
      dtype='object')

In [82]:
df.dtypes

Age            float64
Cabin           object
Embarked        object
Fare           float64
Name            object
Parch            int64
PassengerId      int64
Pclass           int64
Sex             object
SibSp            int64
Survived       float64
Ticket          object
Title           object
Family_Size      int64
dtype: object

<font color="red" size=3><b>Gives statistical analysis of only numerical data</b></font>

In [83]:
df.describe()

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived,Family_Size
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,29.445196,32.204208,0.381594,446.000000,2.308642,0.523008,0.383838,0.904602
std,13.244896,49.693429,0.806057,257.353842,0.836071,1.102743,0.486592,1.613459
min,0.420000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000
25%,22.000000,7.910400,0.000000,223.500000,2.000000,0.000000,0.000000,0.000000
50%,30.000000,14.454200,0.000000,446.000000,3.000000,0.000000,0.000000,0.000000
75%,35.500000,31.000000,0.000000,668.500000,3.000000,1.000000,1.000000,1.000000
max,80.000000,512.329200,6.000000,891.000000,3.000000,8.000000,1.000000,10.000000

<font color="red" size=3><b>To select columns of a particular datatype</b></font>

In [84]:
df.dtypes == "float"

Age             True
Cabin          False
Embarked       False
Fare            True
Name           False
Parch          False
PassengerId    False
Pclass         False
Sex            False
SibSp          False
Survived        True
Ticket         False
Title          False
Family_Size    False
dtype: bool

In [85]:
df.dtypes[df.dtypes == "float"]

Age         float64
Fare        float64
Survived    float64
dtype: object

In [86]:
df.dtypes[df.dtypes == "float"].index

Index(['Age', 'Fare', 'Survived'], dtype='object')

In [87]:
df2 = df[df.dtypes[df.dtypes == "float"].index]
df2

      Age     Fare  Survived
0    22.0   7.2500       0.0
1    38.0  71.2833       1.0
2    26.0   7.9250       1.0
3    35.0  53.1000       1.0
4    35.0   8.0500       0.0
..    ...      ...       ...
886  27.0  13.0000       0.0
887  19.0  30.0000       1.0
888  22.0  23.4500       0.0
889  26.0  30.0000       1.0
890  32.0   7.7500       0.0

[891 rows x 3 columns]

<font color="red" size=3><b>To get statistical analysis of categorical datatype</b></font>

In [104]:
df[df.dtypes[df.dtypes == "object"].index].describe()

          Cabin Embarked                     Name   Sex  Ticket Title
count       204      891                      891   891     891   891
unique      147        3                      891     2     681     6
top     B96 B98        S  Braund, Mr. Owen Harris  male  347082    Mr
freq          4      645                        1   577       7   525

<font color="red" size=3><b>To select particular rows</b></font>

In [88]:
df2[['Fare','Age']][4:20:2]

       Fare   Age
4    8.0500  35.0
6   51.8625  54.0
8   11.1333  27.0
10  16.7000   4.0
12   8.0500  20.0
14   7.8542  14.0
16  29.1250   2.0
18  18.0000  31.0

<font color="red" size=3><b>To create a new column</b></font>

In [90]:
df2['new_col'] = df2['Fare'] + df2['Age'] # Creating a new column based on existing columns
df2

C:\Users\Paulami Maitra\AppData\Local\Temp\ipykernel_6040\1408768906.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['new_col'] = df2['Fare'] + df2['Age'] # Creating a new column based on existing columns

      Age     Fare  Survived   new_col
0    22.0   7.2500       0.0   29.2500
1    38.0  71.2833       1.0  109.2833
2    26.0   7.9250       1.0   33.9250
3    35.0  53.1000       1.0   88.1000
4    35.0   8.0500       0.0   43.0500
..    ...      ...       ...       ...
886  27.0  13.0000       0.0   40.0000
887  19.0  30.0000       1.0   49.0000
888  22.0  23.4500       0.0   45.4500
889  26.0  30.0000       1.0   56.0000
890  32.0   7.7500       0.0   39.7500

[891 rows x 4 columns]

<font color="red" size=3><b>Shows no of unique values in a particular column</b></font>

In [95]:
pd.Categorical(df2['Fare'])

[7.2500, 71.2833, 7.9250, 53.1000, 8.0500, ..., 13.00, 30.00, 23.45, 30.00, 7.75]
Length: 891
Categories (248, float64): [0.0000, 4.0125, 5.0000, 6.2375, ..., 247.5208, 262.3750, 263.0000, 512.3292]

In [97]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title', 'Family_Size'],
      dtype='object')

In [98]:
pd.Categorical(df['Cabin'])

[NaN, 'C85', NaN, 'C123', NaN, ..., NaN, 'B42', NaN, 'C148', NaN]
Length: 891
Categories (147, object): ['A10', 'A14', 'A16', 'A19', ..., 'F38', 'F4', 'G6', 'T']

In [106]:
df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

<font color="red" size=3><b>To filter datasets based on a particular condition </b></font>

In [110]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,Mr,1
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,Mrs,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,Miss,0

In [146]:
# data of people of are more than 20 years of age
a = df[df['Age']>20]
a

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,Mr,1
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,Mrs,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,Miss,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,Mrs,1
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,Mr,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,39.0,NaN,Q,29.1250,"Rice, Mrs. William (Margaret Norton)",5,886,3,female,0,0.0,382652,Mrs,5
886,27.0,NaN,S,13.0000,"Montvila, Rev. Juozas",0,887,2,male,0,0.0,211536,Rev,0
888,22.0,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0.0,W./C. 6607,Miss,3
889,26.0,C148,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1.0,111369,Mr,0
890,32.0,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0.0,370376,Mr,0

In [147]:
# no of people who travelled with 0 fare 
b = df[df["Fare"]==0]
len(df[df["Fare"]==0])

15

In [151]:
# using multiple conditions together
c = df[df['Age']>20 & df["Fare"]==0]
c

TypeError: Cannot perform 'rand_' with a dtyped [float64] array and scalar of type [bool]

In [114]:
# max amount of fare 
max(df['Fare'])

512.3292

In [116]:
# data of people who paid maximum amount of fare
df[df['Fare']==max(df['Fare'])]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
258,35.0,NaN,C,512.3292,"Ward, Miss. Anna",0,259,1,female,0,1.0,PC 17755,Miss,0
679,36.0,B51 B53 B55,C,512.3292,"Cardeza, Mr. Thomas Drake Martinez",1,680,1,male,0,1.0,PC 17755,Mr,1
737,35.0,B101,C,512.3292,"Lesurer, Mr. Gustave J",0,738,1,male,0,1.0,PC 17755,Mr,0